/// @description 여기에 설명 삽입
// 이 에디터에 코드를 작성할 수 있습니다

image_xscale=-1;

msg = [
	["안녕하신가?", "은서", -1],
	["누구세요?", "석환", -1],
	["그건 알 필요 없다네", "은서", -1],
	["여기는 컴공생의 무덤 슬기짜기라네.", "은서", -1],
	["이제 여기서 살아가는 방법을 알려주지.", "은서", -1],
	["아 참고로 현생으로 돌아갈 방법은 없다네.", "은서", -1],
	["딴 생각하지 말고 집중하게나.", "은서", -1],
	["방향키를 통해서 이동할 수 있다네.", "은서", -1],
	["그리고 ASD를 통해서 스킬을 사용할 수 있는데 현재 배운 스킬이 없어서 A로 기본 공격만 할 수 있다네.", "은서", -1],
	["참고로 TAB 키를 통해서 현재 레벨을 저장할 수도 있다네.", "은서", -1],
	["맵의 양 끝에 있는 포털을 통해서 맵을 이동할 수 있으며 마을 사람들에게 F키를 통해 말을 걸어서 퀘스트를 진행하게나.", "은서", -1],
	["지금 내가 퀘스트를 하나 주지.", "은서", -1],
	["초록 돼지를 3마리 잡아오게나.", "은서", -1],
	["그럼 행운을 빈다네.", "은서", -1]
]


      
      
      
      
      
      
      
      
      
     