/// @description 여기에 설명 삽입
// 이 에디터에 코드를 작성할 수 있습니다


//CREATE EVENT
state = "walk_towards_point";
x_var = x-100;
y_var = y;
speed_var = 1;

alarm[0] = 1;

msg = [
	["오우 노우!", "트루로드", -1],
	["왓해픈! 헬프미!", "트루로드", -1],
	["뭐...도와드릴까요?", "석환", -1],
	["오! 아려하세요우!", "트루로드", -1],
	["유 헬프미? 오우 감솨합니돠!", "트루로드", -1],
	["엄...마이 농장 파이어!", "트루로드", -1],
	["몬스터 데어 킬 9!", "트루로드", -1],
	["플리즈! 땡큐!", "트루로드", -1],
	["엄... 그러니깐", "석환", -1],
	["트루로드씨의 농장이 다른 괴물 때문에 불타버렸으니", "석환", -1],
	["그 괴물들 9마리를 처치해달라는 말씀이신거죠?", "석환", -1],
	["예스예스!!", "트루로드", -1],
	["오우 나 개떡 토크 유 찰떡 언더스텐드?!", "트루로드", -1],
	["베리 좋아!", "트루로드", -1],
	["그럼 잘가!", "트루로드", -1],
	["꼭 킬해줘!", "트루로드", -1],
	["아 넵넵.", "석환", -1],
	["그럼 다녀올게요.", "석환", -1]
]