/// @description 여기에 설명 삽입
// 이 에디터에 코드를 작성할 수 있습니다


//CREATE EVENT
state = "walk_towards_point";
x_var = x-100;
y_var = y;
speed_var = 1;

alarm[0] = 1;

msg = [
	["살려줘유~", "주환", -1],
	["슬기짜기에 괴물이 나타났슈~", "주환", -1],
	["도와...드려요?", "석환", -1],
	["아유 고마워유~", "주환", -1],
	["안그래도 요즘 슬기짜기에 괴한들이 나타나서 살아남기 힘들었는데 너무 고마워유~", "주환", -1],
	["초록 돼지를 6마리 잡아와주슈~", "주환", -1],
	["뭐 과제에 비하면 껌이죠!", "석환", -1],
	["아유 무슨 과젝 얼마나 힘들길래...", "주환", -1],
	["컴공생으로 살아가기도 만만치 않구만 그려~", "주환", -1],
	["힘내슈!", "주환", -1],
	["넵 그럼 다녀오겠습니다!", "석환", -1]
]